Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0128MCA032.PIC
              <edc:DCRFieldSemantic edc:cname="MUL_123" edc:desc="PLL Multiply by 123" edc:when="(field &amp; 0x7F) == 0x7a"/>
              <edc:DCRFieldSemantic edc:cname="MUL_124" edc:desc="PLL Multiply by 124" edc:when="(field &amp; 0x7F) == 0x7b"/>
              <edc:DCRFieldSemantic edc:cname="MUL_125" edc:desc="PLL Multiply by 125" edc:when="(field &amp; 0x7F) == 0x7c"/>
              <edc:DCRFieldSemantic edc:cname="MUL_126" edc:desc="PLL Multiply by 126" edc:when="(field &amp; 0x7F) == 0x7d"/>
              <edc:DCRFieldSemantic edc:cname="MUL_127" edc:desc="PLL Multiply by 127" edc:when="(field &amp; 0x7F) == 0x7e"/>
              <edc:DCRFieldSemantic edc:cname="MUL_128" edc:desc="PLL Multiply by 128" edc:when="(field &amp; 0x7F) == 0x7f"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="FPLLODIV" edc:desc="System PLL Output Clock Divider" edc:mask="0x7" edc:name="FPLLODIV" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="DIV_2" edc:desc="2x Divider" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DIV_4" edc:desc="4x Divider" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="DIV_8" edc:desc="8x Divider" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="DIV_16" edc:desc="16x Divider" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="DIV_32" edc:desc="32x Divider" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="10"/>
            <edc:DCRFieldDef edc:cname="BORSEL" edc:desc="Brown-out trip voltage" edc:mask="0x1" edc:name="BORSEL" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="HIGH" edc:desc="BOR trip voltage 2.1v (Non-OPAMP deviced operation)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LOW" edc:desc="BOR trip voltage 2.8v (OPAMP deviced operation)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnnnnnnnnnnnnnnn---nnnnnnnnnnn" edc:cname="DEVCFG1" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffc7ff" edc:name="DEVCFG1" edc:nzwidth="0x20" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xffffffff" edc:default="0xffffffff" edc:_addr="0x1FC03FC8">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FNOSC" edc:desc="Oscillator Selection Bits" edc:mask="0x7" edc:name="FNOSC" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="FRC" edc:desc="Internal Fast RC (FRC)" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="SPLL" edc:desc="System PLL" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="POSC" edc:desc="Primary Osc (HS,EC)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="UPLL" edc:desc="USB PLL (UPLL)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="Low Power Secondary Osc (SOSC)" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="Low Power RC Osc (LPRC)" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DMTINTV" edc:desc="DMT Count Window Interval" edc:mask="0x7" edc:name="DMTINTV" edc:nzwidth="3">
              <edc:DCRFieldSemantic edc:cname="WIN_0" edc:desc="Window/Interval value is zero" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="WIN_1_2" edc:desc="Window/Interval value is 1/2 counter value" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WIN_3_4" edc:desc="Window/Interval value is 3/4 counter value" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="WIN_7_8" edc:desc="Window/Interval value is 7/8 counter value" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="WIN_15_16" edc:desc="Window/Interval value is 15/16 counter value" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="WIN_31_32" edc:desc="Window/Interval value is 31/32 counter value" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="WIN_63_64" edc:desc="Window/Interval value is 63/64 counter value" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="WIN_127_128" edc:desc="Window/Interval value is 127/128 counter value" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FSOSCEN" edc:desc="Secondary Oscillator Enable" edc:mask="0x1" edc:name="FSOSCEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enable Secondary Oscillator" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disable Secondary Oscillator" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IESO" edc:desc="Internal/External Switch Over" edc:mask="0x1" edc:name="IESO" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="POSCMOD" edc:desc="Primary Oscillator Configuration" edc:mask="0x3" edc:name="POSCMOD" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="EC" edc:desc="External clock mode" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS osc mode" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Primary osc disabled" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="OSCIOFNC" edc:desc="CLKO Output Signal Active on the OSCO Pin" edc:mask="0x1" edc:name="OSCIOFNC" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:DCRFieldDef edc:cname="FCKSM" edc:desc="Clock Switching and Monitor Selection" edc:mask="0x3" edc:name="FCKSM" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="CSDCMD" edc:desc="Clock Switch Disabled, FSCM Disabled" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="CSECMD" edc:desc="Clock Switch Enabled, FSCM Disabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CSDCME" edc:desc="Clock Switch Disabled, FSCM Enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="CSECME" edc:desc="Clock Switch Enabled, FSCM Enabled" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTPS" edc:desc="Watchdog Timer Postscaler" edc:mask="0x1f" edc:name="WDTPS" edc:nzwidth="0x5">
              <edc:DCRFieldSemantic edc:cname="PS1" edc:desc="1:1" edc:when="(field &amp; 0x1f) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="PS2" edc:desc="1:2" edc:when="(field &amp; 0x1f) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PS4" edc:desc="1:4" edc:when="(field &amp; 0x1f) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PS8" edc:desc="1:8" edc:when="(field &amp; 0x1f) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PS16" edc:desc="1:16" edc:when="(field &amp; 0x1f) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PS32" edc:desc="1:32" edc:when="(field &amp; 0x1f) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="PS64" edc:desc="1:64" edc:when="(field &amp; 0x1f) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="PS128" edc:desc="1:128" edc:when="(field &amp; 0x1f) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="PS256" edc:desc="1:256" edc:when="(field &amp; 0x1f) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="PS512" edc:desc="1:512" edc:when="(field &amp; 0x1f) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="PS1024" edc:desc="1:1024" edc:when="(field &amp; 0x1f) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="PS2048" edc:desc="1:2048" edc:when="(field &amp; 0x1f) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="PS4096" edc:desc="1:4096" edc:when="(field &amp; 0x1f) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="PS8192" edc:desc="1:8192" edc:when="(field &amp; 0x1f) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="PS16384" edc:desc="1:16384" edc:when="(field &amp; 0x1f) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="PS32768" edc:desc="1:32768" edc:when="(field &amp; 0x1f) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="PS65536" edc:desc="1:65536" edc:when="(field &amp; 0x17) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="PS131072" edc:desc="1:131072" edc:when="(field &amp; 0x17) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="PS262144" edc:desc="1:262144" edc:when="(field &amp; 0x17) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="PS524288" edc:desc="1:524288" edc:when="(field &amp; 0x17) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="PS1048576" edc:desc="1:1048576" edc:when="(field &amp; 0x14) == 0x14"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTSPGM" edc:desc="Watchdog Timer Stop During Flash Programming" edc:mask="0x1" edc:name="WDTSPGM" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="RUN" edc:desc="WDT runs during Flash programming" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="STOP" edc:desc="WDT stops during Flash programming" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WINDIS" edc:desc="Watchdog Timer Window Mode" edc:mask="0x1" edc:name="WINDIS" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="NORMAL" edc:desc="Watchdog Timer is in non-Window mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WINDOW" edc:desc="Watchdog Timer is in Window mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FWDTEN" edc:desc="Watchdog Timer Enable" edc:mask="0x1" edc:name="FWDTEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="WDT Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="WDT Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FWDTWINSZ" edc:desc="Watchdog Timer Window Size" edc:mask="0x3" edc:name="FWDTWINSZ" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="WINSZ_25" edc:desc="Window size is 25%" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="WINSZ_37" edc:desc="Window size is 37.5%" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="WINSZ_50" edc:desc="Window size is 50%" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WINSZ_75" edc:desc="Window size is 75%" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DMTCNT" edc:desc="Deadman Timer Count Selection" edc:mask="0x1f" edc:name="DMTCNT" edc:nzwidth="5">
              <edc:DCRFieldSemantic edc:cname="DMT8" edc:desc="2^8 (256)" edc:when="(field &amp; 0x1f) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="DMT9" edc:desc="2^9 (512)" edc:when="(field &amp; 0x1f) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DMT10" edc:desc="2^10 (1024)" edc:when="(field &amp; 0x1f) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="DMT11" edc:desc="2^11 (2048)" edc:when="(field &amp; 0x1f) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="DMT12" edc:desc="2^12 (4096)" edc:when="(field &amp; 0x1f) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="DMT13" edc:desc="2^13 (8192)" edc:when="(field &amp; 0x1f) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="DMT14" edc:desc="2^14 (16384)" edc:when="(field &amp; 0x1f) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="DMT15" edc:desc="2^15 (32768)" edc:when="(field &amp; 0x1f) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="DMT16" edc:desc="2^16 (65536)" edc:when="(field &amp; 0x1f) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="DMT17" edc:desc="2^17 (131072)" edc:when="(field &amp; 0x1f) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="DMT18" edc:desc="2^18 (262144)" edc:when="(field &amp; 0x1f) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="DMT19" edc:desc="2^19 (524288)" edc:when="(field &amp; 0x1f) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="DMT20" edc:desc="2^20 (1048576)" edc:when="(field &amp; 0x1f) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="DMT21" edc:desc="2^21 (2097152)" edc:when="(field &amp; 0x1f) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="DMT22" edc:desc="2^22 (4194304)" edc:when="(field &amp; 0x1f) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="DMT23" edc:desc="2^23 (8388608)" edc:when="(field &amp; 0x1f) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="DMT24" edc:desc="2^24 (16777216)" edc:when="(field &amp; 0x1f) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="DMT25" edc:desc="2^25 (33554432)" edc:when="(field &amp; 0x1f) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="DMT26" edc:desc="2^26 (67108864)" edc:when="(field &amp; 0x1f) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="DMT27" edc:desc="2^27 (134217728)" edc:when="(field &amp; 0x1f) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="DMT28" edc:desc="2^28 (268435456)" edc:when="(field &amp; 0x1f) == 0x14"/>
              <edc:DCRFieldSemantic edc:cname="DMT29" edc:desc="2^29 (536870912)" edc:when="(field &amp; 0x1f) == 0x15"/>
              <edc:DCRFieldSemantic edc:cname="DMT30" edc:desc="2^30 (1073741824)" edc:when="(field &amp; 0x1f) == 0x16"/>
              <edc:DCRFieldSemantic edc:cname="DMT31" edc:desc="2^31 (2147483648)" edc:when="(field &amp; 0x1f) == 0x17"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FDMTEN" edc:desc="Deadman Timer Enable" edc:mask="0x1" edc:name="FDMTEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Deadman Timer is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Deadman Timer is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
