Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0128MCA032.PIC
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="IC2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="IC2R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="10" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F80143C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC2R" edc:desc="" edc:mask="0xf" edc:name="IC2R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="IC3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="IC3R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="11" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801440">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC3R" edc:desc="" edc:mask="0xf" edc:name="IC3R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="IC4R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="IC4R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="12" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801444">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC4R" edc:desc="" edc:mask="0xf" edc:name="IC4R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x14" edc:_addr="0x1F801448"/>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="OCFAR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="OCFAR" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="13" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F80145C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OCFAR" edc:desc="" edc:mask="0xf" edc:name="OCFAR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="OCFBR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="OCFBR" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="14" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801460">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OCFBR" edc:desc="" edc:mask="0xf" edc:name="OCFBR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="U1RXR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="U1RXR" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="15" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801464">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U1RXR" edc:desc="" edc:mask="0xf" edc:name="U1RXR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="U1CTSR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="U1CTSR" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="16" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801468">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U1CTSR" edc:desc="" edc:mask="0xf" edc:name="U1CTSR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="U2RXR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="U2RXR" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="17" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F80146C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U2RXR" edc:desc="" edc:mask="0xf" edc:name="U2RXR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="U2CTSR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="U2CTSR" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="18" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801470">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U2CTSR" edc:desc="" edc:mask="0xf" edc:name="U2CTSR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="U3RXR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="U3RXR" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="19" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801474">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U3RXR" edc:desc="" edc:mask="0xf" edc:name="U3RXR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
