Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0128MCA032.PIC
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPB15R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPB15R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="24" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F80167C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB15R" edc:desc="" edc:mask="0x1f" edc:name="RPB15R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPC0R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC0R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="25" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801680">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC0R" edc:desc="" edc:mask="0x1f" edc:name="RPC0R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPC1R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC1R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="26" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801684">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC1R" edc:desc="" edc:mask="0x1f" edc:name="RPC1R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPC2R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC2R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="27" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801688">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC2R" edc:desc="" edc:mask="0x1f" edc:name="RPC2R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x0C" edc:_addr="0x1F80168C"/>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPC6R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC6R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="28" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801698">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC6R" edc:desc="" edc:mask="0x1f" edc:name="RPC6R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPC7R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC7R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="29" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F80169C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC7R" edc:desc="" edc:mask="0x1f" edc:name="RPC7R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPC8R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC8R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="30" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8016A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC8R" edc:desc="" edc:mask="0x1f" edc:name="RPC8R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPC9R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC9R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="31" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8016A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC9R" edc:desc="" edc:mask="0x1f" edc:name="RPC9R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPC10R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC10R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="32" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8016A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC10R" edc:desc="" edc:mask="0x1f" edc:name="RPC10R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x04" edc:_addr="0x1F8016AC"/>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPC12R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC12R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="33" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8016B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC12R" edc:desc="" edc:mask="0x1f" edc:name="RPC12R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x08" edc:_addr="0x1F8016B4"/>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPC15R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC15R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="34" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8016BC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC15R" edc:desc="" edc:mask="0x1f" edc:name="RPC15R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x20" edc:_addr="0x1F8016C0"/>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPD8R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPD8R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="35" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8016E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD8R" edc:desc="" edc:mask="0x1f" edc:name="RPD8R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x11C" edc:_addr="0x1F8016E4"/>
      <edc:SFRDef edc:access="----------------nnn-nn-n----nnnn" edc:cname="HLVDCON" edc:desc="" edc:impl="0xed0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000-00-0----0000" edc:name="HLVDCON" edc:nzwidth="32" edc:por="----------------000-00-0----0000" edc:portals="CLR SET INV" ltx:baseofperipheral="HLVD" edc:_modsrc="DOS-02511_pwr_sib_upb_v1_32bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x1F801800">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="HLVDL" edc:desc="" edc:mask="0xf" edc:name="HLVDL" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="HLEVT" edc:desc="" edc:mask="0x1" edc:name="HLEVT" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="BGVST" edc:desc="" edc:mask="0x1" edc:name="BGVST" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="VDIR" edc:desc="" edc:mask="0x1" edc:name="VDIR" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="HLVD" edc:pos="14"/>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1f810000" edc:endaddr="0x1f812000" edc:kseg1="0xa0000000" edc:regionid="periph_pb1_fast">
      <edc:SFRDef edc:access="nnnnnnnn---------n-n-nnn---nnnnn" edc:cname="INTCON" edc:desc="" edc:impl="0xff00571f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu---------x-0-000---00000" edc:name="INTCON" edc:nzwidth="32" edc:por="xxxxxxxx---------x-0-000---00000" edc:portals="CLR SET INV" ltx:baseofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INT0EP" edc:desc="" edc:mask="0x1" edc:name="INT0EP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT1EP" edc:desc="" edc:mask="0x1" edc:name="INT1EP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT2EP" edc:desc="" edc:mask="0x1" edc:name="INT2EP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT3EP" edc:desc="" edc:mask="0x1" edc:name="INT3EP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT4EP" edc:desc="" edc:mask="0x1" edc:name="INT4EP" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="TPC" edc:desc="" edc:mask="0x7" edc:name="TPC" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MVEC" edc:desc="" edc:mask="0x1" edc:name="MVEC" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="NMIKEY" edc:mask="0xff" edc:name="NMIKEY" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="INTERRUPT CONTROL" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnn---n" edc:cname="PRISS" edc:desc="" edc:impl="0xfffffff1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000---0" edc:name="PRISS" edc:nzwidth="32" edc:por="0000000000000000000000000000---0" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810010">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SS0" edc:desc="" edc:mask="0x1" edc:name="SS0" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PRI1SS" edc:desc="" edc:mask="0xf" edc:name="PRI1SS" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PRI2SS" edc:desc="" edc:mask="0xf" edc:name="PRI2SS" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PRI3SS" edc:desc="" edc:mask="0xf" edc:name="PRI3SS" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PRI4SS" edc:desc="" edc:mask="0xf" edc:name="PRI4SS" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PRI5SS" edc:desc="" edc:mask="0xf" edc:name="PRI5SS" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PRI6SS" edc:desc="" edc:mask="0xf" edc:name="PRI6SS" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PRI7SS" edc:desc="" edc:mask="0xf" edc:name="PRI7SS" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------rrrrrrrrrrr" edc:cname="INTSTAT" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------00000000000" edc:name="INTSTAT" edc:nzwidth="32" edc:por="---------------------00000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810020">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SIRQ" edc:desc="" edc:mask="0xff" edc:name="SIRQ" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="SRIPL" edc:desc="" edc:mask="0x7" edc:name="SRIPL" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IPTMR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="IPTMR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810030">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IPTMR" edc:desc="" edc:mask="0xffffffff" edc:name="IPTMR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nn-----nnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS0" edc:desc="" edc:impl="0xc1ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-----0000000000000000000000000" edc:name="IFS0" edc:nzwidth="32" edc:por="00-----0000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810040">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CTIF" edc:desc="" edc:mask="0x1" edc:name="CTIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS0IF" edc:desc="" edc:mask="0x1" edc:name="CS0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS1IF" edc:desc="" edc:mask="0x1" edc:name="CS1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT0IF" edc:desc="" edc:mask="0x1" edc:name="INT0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T1IF" edc:desc="" edc:mask="0x1" edc:name="T1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC1EIF" edc:desc="" edc:mask="0x1" edc:name="IC1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC1IF" edc:desc="" edc:mask="0x1" edc:name="IC1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC1IF" edc:desc="" edc:mask="0x1" edc:name="OC1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT1IF" edc:desc="" edc:mask="0x1" edc:name="INT1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T2IF" edc:desc="" edc:mask="0x1" edc:name="T2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2EIF" edc:desc="" edc:mask="0x1" edc:name="IC2EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2IF" edc:desc="" edc:mask="0x1" edc:name="IC2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC2IF" edc:desc="" edc:mask="0x1" edc:name="OC2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT2IF" edc:desc="" edc:mask="0x1" edc:name="INT2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T3IF" edc:desc="" edc:mask="0x1" edc:name="T3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3EIF" edc:desc="" edc:mask="0x1" edc:name="IC3EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3IF" edc:desc="" edc:mask="0x1" edc:name="IC3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC3IF" edc:desc="" edc:mask="0x1" edc:name="OC3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT3IF" edc:desc="" edc:mask="0x1" edc:name="INT3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T4IF" edc:desc="" edc:mask="0x1" edc:name="T4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4EIF" edc:desc="" edc:mask="0x1" edc:name="IC4EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4IF" edc:desc="" edc:mask="0x1" edc:name="IC4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC4IF" edc:desc="" edc:mask="0x1" edc:name="OC4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT4IF" edc:desc="" edc:mask="0x1" edc:name="INT4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T5IF" edc:desc="" edc:mask="0x1" edc:name="T5IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="RTCCIF" edc:desc="" edc:mask="0x1" edc:name="RTCCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FCEIF" edc:desc="" edc:mask="0x1" edc:name="FCEIF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xcfffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--nnnnnnnnn-----nnnnnnnnnnnnn-nn" edc:cname="IFS1" edc:desc="" edc:impl="0x3fe0dffb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000000-----0000000000000-00" edc:name="IFS1" edc:nzwidth="32" edc:por="--000000000-----0000000000000-00" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810050">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMP1IF" edc:desc="" edc:mask="0x1" edc:name="CMP1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP2IF" edc:desc="" edc:mask="0x1" edc:name="CMP2IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SPI1EIF" edc:desc="" edc:mask="0x1" edc:name="SPI1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI1RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI1TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1EIF" edc:desc="" edc:mask="0x1" edc:name="U1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1RXIF" edc:desc="" edc:mask="0x1" edc:name="U1RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1TXIF" edc:desc="" edc:mask="0x1" edc:name="U1TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1BIF" edc:desc="" edc:mask="0x1" edc:name="I2C1BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1SIF" edc:desc="" edc:mask="0x1" edc:name="I2C1SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1MIF" edc:desc="" edc:mask="0x1" edc:name="I2C1MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNAIF" edc:desc="" edc:mask="0x1" edc:name="CNAIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNBIF" edc:desc="" edc:mask="0x1" edc:name="CNBIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNCIF" edc:desc="" edc:mask="0x1" edc:name="CNCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNDIF" edc:desc="" edc:mask="0x1" edc:name="CNDIF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="SPI2EIF" edc:desc="" edc:mask="0x1" edc:name="SPI2EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI2RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI2TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2EIF" edc:desc="" edc:mask="0x1" edc:name="U2EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2RXIF" edc:desc="" edc:mask="0x1" edc:name="U2RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2TXIF" edc:desc="" edc:mask="0x1" edc:name="U2TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2BIF" edc:desc="" edc:mask="0x1" edc:name="I2C2BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2SIF" edc:desc="" edc:mask="0x1" edc:name="I2C2SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2MIF" edc:desc="" edc:mask="0x1" edc:name="I2C2MIF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
