Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0128MCA032.PIC
      <edc:SFRDef edc:access="---------------------n-nn--n--nn" edc:cname="CNENA" edc:desc="" edc:grp="PORTA" edc:impl="0xffc00593" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------0-00--0--00" edc:name="CNENA" edc:nzwidth="0x20" edc:por="---------------------0-00--0--00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEA0" edc:desc="" edc:mask="0x1" edc:name="CNIEA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA1" edc:desc="" edc:mask="0x1" edc:name="CNIEA1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEA4" edc:desc="" edc:mask="0x1" edc:name="CNIEA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEA7" edc:desc="" edc:mask="0x1" edc:name="CNIEA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA8" edc:desc="" edc:mask="0x1" edc:name="CNIEA8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEA10" edc:desc="" edc:mask="0x1" edc:name="CNIEA10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------n-nn--n--nn" edc:cname="CNSTATA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff0593" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------0-00--0--00" edc:name="CNSTATA" edc:nzwidth="0x20" edc:por="---------------------0-00--0--00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860090">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATA0" edc:desc="" edc:mask="0x1" edc:name="CNSTATA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA1" edc:desc="" edc:mask="0x1" edc:name="CNSTATA1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA4" edc:desc="" edc:mask="0x1" edc:name="CNSTATA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA7" edc:desc="" edc:mask="0x1" edc:name="CNSTATA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA8" edc:desc="" edc:mask="0x1" edc:name="CNSTATA8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA10" edc:desc="" edc:mask="0x1" edc:name="CNSTATA10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------n-nn--n--nn" edc:cname="CNNEA" edc:desc="" edc:impl="0x593" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------0-00--0--00" edc:name="CNNEA" edc:nzwidth="32" edc:por="---------------------0-00--0--00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F8600A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNEA0" edc:mask="0x1" edc:name="CNNEA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEA1" edc:mask="0x1" edc:name="CNNEA1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEA4" edc:mask="0x1" edc:name="CNNEA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEA7" edc:mask="0x1" edc:name="CNNEA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEA8" edc:mask="0x1" edc:name="CNNEA8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEA10" edc:mask="0x1" edc:name="CNNEA10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------n-nn--n--nn" edc:cname="CNFA" edc:desc="" edc:impl="0x593" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------0-00--0--00" edc:name="CNFA" edc:nzwidth="32" edc:por="---------------------0-00--0--00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F8600B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFA0" edc:mask="0x1" edc:name="CNFA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFA1" edc:mask="0x1" edc:name="CNFA1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFA4" edc:mask="0x1" edc:name="CNFA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFA7" edc:mask="0x1" edc:name="CNFA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFA8" edc:mask="0x1" edc:name="CNFA8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFA10" edc:mask="0x1" edc:name="CNFA10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------n-nn-------" edc:cname="SRCON0A" edc:desc="" edc:impl="0x580" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------0-00-------" edc:name="SRCON0A" edc:nzwidth="32" edc:por="---------------------0-00-------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F8600C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0A7" edc:mask="0x1" edc:name="SR0A7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0A8" edc:mask="0x1" edc:name="SR0A8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0A10" edc:mask="0x1" edc:name="SR0A10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------n-nn-------" edc:cname="SRCON1A" edc:desc="" edc:impl="0x580" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------0-00-------" edc:name="SRCON1A" edc:nzwidth="32" edc:por="---------------------0-00-------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F8600D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1A7" edc:mask="0x1" edc:name="SR1A7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1A8" edc:mask="0x1" edc:name="SR1A8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1A10" edc:mask="0x1" edc:name="SR1A10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
