Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0128MCA032.PIC
      <edc:SFRDef edc:access="----------------nnnnnn--nn-n----" edc:cname="SRCON0B" edc:desc="" edc:impl="0xfcd0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000000--00-0----" edc:name="SRCON0B" edc:nzwidth="32" edc:por="----------------000000--00-0----" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F8601C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0B4" edc:mask="0x1" edc:name="SR0B4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0B6" edc:mask="0x1" edc:name="SR0B6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B7" edc:mask="0x1" edc:name="SR0B7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0B10" edc:mask="0x1" edc:name="SR0B10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B11" edc:mask="0x1" edc:name="SR0B11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B12" edc:mask="0x1" edc:name="SR0B12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B13" edc:mask="0x1" edc:name="SR0B13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B14" edc:mask="0x1" edc:name="SR0B14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B15" edc:mask="0x1" edc:name="SR0B15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnn--nn-n----" edc:cname="SRCON1B" edc:desc="" edc:impl="0xfcd0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000000--00-0----" edc:name="SRCON1B" edc:nzwidth="32" edc:por="----------------000000--00-0----" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F8601D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1B4" edc:mask="0x1" edc:name="SR1B4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1B6" edc:mask="0x1" edc:name="SR1B6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B7" edc:mask="0x1" edc:name="SR1B7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1B10" edc:mask="0x1" edc:name="SR1B10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B11" edc:mask="0x1" edc:name="SR1B11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B12" edc:mask="0x1" edc:name="SR1B12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B13" edc:mask="0x1" edc:name="SR1B13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B14" edc:mask="0x1" edc:name="SR1B14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B15" edc:mask="0x1" edc:name="SR1B15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x20" edc:_addr="0x1F8601E0"/>
      <edc:SFRDef edc:access="----------------n--nn-----------" edc:cname="ANSELC" edc:desc="" edc:grp="PORTC" edc:impl="0xffff9800" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1--11-----------" edc:name="ANSELC" edc:nzwidth="0x20" edc:por="----------------1--11-----------" edc:portals="CLR SET INV" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860200">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSC11" edc:desc="" edc:mask="0x1" edc:name="ANSC11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSC12" edc:desc="" edc:mask="0x1" edc:name="ANSC12" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSC15" edc:desc="" edc:mask="0x1" edc:name="ANSC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------n--nn-----------" edc:cname="TRISC" edc:desc="" edc:grp="PORTC" edc:impl="0xffff9800" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1--11-----------" edc:name="TRISC" edc:nzwidth="0x20" edc:por="----------------1--11-----------" edc:portals="CLR SET INV" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860210">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISC11" edc:desc="" edc:mask="0x1" edc:name="TRISC11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISC12" edc:desc="" edc:mask="0x1" edc:name="TRISC12" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISC15" edc:desc="" edc:mask="0x1" edc:name="TRISC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------n--nn-----------" edc:cname="PORTC" edc:desc="" edc:grp="PORTC" edc:impl="0xffff9800" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------x--xx-----------" edc:name="PORTC" edc:nzwidth="0x20" edc:por="----------------x--xx-----------" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTC" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860220">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RC11" edc:desc="" edc:mask="0x1" edc:name="RC11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RC12" edc:desc="" edc:mask="0x1" edc:name="RC12" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RC15" edc:desc="" edc:mask="0x1" edc:name="RC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
