Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0128MCA032.PIC
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="ADCIMCON2" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="ADCIMCON2" edc:nzwidth="32" edc:por="----------------------------0000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_WACP_adc_sar_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe20" edc:_addr="0x1F887050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SIGN16" edc:mask="0x1" edc:name="SIGN16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF16" edc:mask="0x1" edc:name="DIFF16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN17" edc:mask="0x1" edc:name="SIGN17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF17" edc:mask="0x1" edc:name="DIFF17" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x20" edc:_modsrc="DOS-02508_WACP_adc_sar_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe20" edc:_addr="0x1F887060"/>
      <edc:SFRDef edc:access="--------------nnn-nn--n---nnnnnn" edc:cname="ADCGIRQEN1" edc:desc="" edc:impl="0x3b23f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------000-00--0---000000" edc:name="ADCGIRQEN1" edc:nzwidth="32" edc:por="--------------000-00--0---000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_WACP_adc_sar_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe20" edc:_addr="0x1F887080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AGIEN0" edc:mask="0x1" edc:name="AGIEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN1" edc:mask="0x1" edc:name="AGIEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN2" edc:mask="0x1" edc:name="AGIEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN3" edc:mask="0x1" edc:name="AGIEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN4" edc:mask="0x1" edc:name="AGIEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN5" edc:mask="0x1" edc:name="AGIEN5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="AGIEN9" edc:mask="0x1" edc:name="AGIEN9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="AGIEN12" edc:mask="0x1" edc:name="AGIEN12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN13" edc:mask="0x1" edc:name="AGIEN13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="AGIEN15" edc:mask="0x1" edc:name="AGIEN15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN16" edc:mask="0x1" edc:name="AGIEN16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN17" edc:mask="0x1" edc:name="AGIEN17" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------n--n------------------" edc:cname="ADCGIRQEN2" edc:desc="" edc:impl="0x240000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------0--0------------------" edc:name="ADCGIRQEN2" edc:nzwidth="32" edc:por="----------0--0------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_WACP_adc_sar_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe20" edc:_addr="0x1F887090">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="18"/>
            <edc:SFRFieldDef edc:cname="AGIEN50" edc:mask="0x1" edc:name="AGIEN50" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="AGIEN53" edc:mask="0x1" edc:name="AGIEN53" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnn-nn--n---nnnnnn" edc:cname="ADCCSS1" edc:desc="" edc:impl="0x3b23f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------000-00--0---000000" edc:name="ADCCSS1" edc:nzwidth="32" edc:por="--------------000-00--0---000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_WACP_adc_sar_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe20" edc:_addr="0x1F8870A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CSS0" edc:mask="0x1" edc:name="CSS0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS1" edc:mask="0x1" edc:name="CSS1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS2" edc:mask="0x1" edc:name="CSS2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS3" edc:mask="0x1" edc:name="CSS3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS4" edc:mask="0x1" edc:name="CSS4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS5" edc:mask="0x1" edc:name="CSS5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CSS9" edc:mask="0x1" edc:name="CSS9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CSS12" edc:mask="0x1" edc:name="CSS12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS13" edc:mask="0x1" edc:name="CSS13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CSS15" edc:mask="0x1" edc:name="CSS15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS16" edc:mask="0x1" edc:name="CSS16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS17" edc:mask="0x1" edc:name="CSS17" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
