Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0128MCA032.PIC
      <edc:SFRDef edc:access="---nnnnnnnnnnnnn------nnnnnnnnnn" edc:cname="ADC0TIME" edc:desc="" edc:impl="0x1fff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000u0000000------0000000000" edc:name="ADC0TIME" edc:nzwidth="32" edc:por="---00000x0000000------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_WACP_adc_sar_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe20" edc:_addr="0x1F887350">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="BCHEN" edc:mask="0x1" edc:name="BCHEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:mask="0x7" edc:name="ADCEIS" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnnnnnnnnnn------nnnnnnnnnn" edc:cname="ADC1TIME" edc:desc="" edc:impl="0x1fff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000u0000000------0000000000" edc:name="ADC1TIME" edc:nzwidth="32" edc:por="---00000x0000000------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_WACP_adc_sar_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe20" edc:_addr="0x1F887360">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="BCHEN" edc:mask="0x1" edc:name="BCHEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:mask="0x7" edc:name="ADCEIS" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x50" edc:_modsrc="DOS-02508_WACP_adc_sar_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe20" edc:_addr="0x1F887370"/>
      <edc:SFRDef edc:access="--------------nnn-nn--n---nnnnnn" edc:cname="ADCEIEN1" edc:desc="" edc:impl="0x3b23f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------000-00--0---000000" edc:name="ADCEIQEN1" edc:nzwidth="32" edc:por="--------------000-00--0---000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_WACP_adc_sar_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe20" edc:_addr="0x1F8873C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EIEN0" edc:mask="0x1" edc:name="EIEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN1" edc:mask="0x1" edc:name="EIEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN2" edc:mask="0x1" edc:name="EIEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN3" edc:mask="0x1" edc:name="EIEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN4" edc:mask="0x1" edc:name="EIEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN5" edc:mask="0x1" edc:name="EIEN5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EIEN9" edc:mask="0x1" edc:name="EIEN9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EIEN12" edc:mask="0x1" edc:name="EIEN12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN13" edc:mask="0x1" edc:name="EIEN13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EIEN15" edc:mask="0x1" edc:name="EIEN15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN16" edc:mask="0x1" edc:name="EIEN16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN17" edc:mask="0x1" edc:name="EIEN17" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------n--n------------------" edc:cname="ADCEIEN2" edc:desc="" edc:impl="0x240000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------0--0------------------" edc:name="ADCEIQEN2" edc:nzwidth="32" edc:por="----------0--0------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_WACP_adc_sar_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe20" edc:_addr="0x1F8873D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="18"/>
            <edc:SFRFieldDef edc:cname="EIEN50" edc:mask="0x1" edc:name="EIEN50" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="EIEN53" edc:mask="0x1" edc:name="EIEN53" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------rrr-rr--r---rrrrrr" edc:cname="ADCEISTAT1" edc:desc="" edc:impl="0x3b23f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------000-00--0---000000" edc:name="ADCEISTAT1" edc:nzwidth="32" edc:por="--------------000-00--0---000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_WACP_adc_sar_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe20" edc:_addr="0x1F8873E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EIRDY0" edc:mask="0x1" edc:name="EIRDY0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY1" edc:mask="0x1" edc:name="EIRDY1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY2" edc:mask="0x1" edc:name="EIRDY2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY3" edc:mask="0x1" edc:name="EIRDY3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY4" edc:mask="0x1" edc:name="EIRDY4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY5" edc:mask="0x1" edc:name="EIRDY5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EIRDY9" edc:mask="0x1" edc:name="EIRDY9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EIRDY12" edc:mask="0x1" edc:name="EIRDY12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY13" edc:mask="0x1" edc:name="EIRDY13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EIRDY15" edc:mask="0x1" edc:name="EIRDY15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY16" edc:mask="0x1" edc:name="EIRDY16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY17" edc:mask="0x1" edc:name="EIRDY17" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------n--n------------------" edc:cname="ADCEISTAT2" edc:desc="" edc:impl="0x240000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------u--u------------------" edc:name="ADCEISTAT2" edc:nzwidth="32" edc:por="----------x--x------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_WACP_adc_sar_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe20" edc:_addr="0x1F8873F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="18"/>
            <edc:SFRFieldDef edc:cname="EIRDY50" edc:mask="0x1" edc:name="EIRDY50" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="EIRDY53" edc:mask="0x1" edc:name="EIRDY53" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----nnnnn-----nnr-----rrn-----nn" edc:cname="ADCANCON" edc:desc="" edc:impl="0xf838383" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----00000-----000-----000-----00" edc:name="ADCANCON" edc:nzwidth="32" edc:por="----00000-----000-----000-----00" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_WACP_adc_sar_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe20" edc:_addr="0x1F887400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ANEN0" edc:mask="0x1" edc:name="ANEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANEN1" edc:mask="0x1" edc:name="ANEN1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="ANEN7" edc:mask="0x1" edc:name="ANEN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKRDY0" edc:mask="0x1" edc:name="WKRDY0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKRDY1" edc:mask="0x1" edc:name="WKRDY1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="WKRDY7" edc:mask="0x1" edc:name="WKRDY7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN0" edc:mask="0x1" edc:name="WKIEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN1" edc:mask="0x1" edc:name="WKIEN1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="WKIEN7" edc:mask="0x1" edc:name="WKIEN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKUPCLKCNT" edc:mask="0xf" edc:name="WKUPCLKCNT" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1F0" edc:_modsrc="DOS-02508_WACP_adc_sar_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe20" edc:_addr="0x1F887410"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCDATA0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCDATA0" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_WACP_adc_sar_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe20" edc:_addr="0x1F887600">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCDATA1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCDATA1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_WACP_adc_sar_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe20" edc:_addr="0x1F887610">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
